type.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>type</title>
<!-- 2018-06-08 五 15:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="yuanchuan cao" />
</head>
<body>
<div id="content">
<h1 class="title">type</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. introduction</a>
<ul>
<li><a href="#sec-1-1">1.1. eBattleDefineDB</a></li>
<li><a href="#sec-1-2">1.2. 技能的种类.eSkillContentType</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="krr.html">go back to code-map</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> introduction</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> eBattleDefineDB</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-csharp"><span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">enum</span> <span style="color: #7CB8BB;">eBattleDefineDB</span>
{
        <span style="color: #DFAF8F;">OrderValueBaseMin</span>,   <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">1</span>
        <span style="color: #DFAF8F;">OrderValueBaseMax</span>,    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">100</span>
        <span style="color: #DFAF8F;">OrderValueDecreaseStart</span>,  <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">50</span>
        <span style="color: #DFAF8F;">OrderValueDecreaseInterval</span>, <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">2</span>
        <span style="color: #DFAF8F;">OrderValueMin</span>,   <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">15</span>
        <span style="color: #DFAF8F;">OrderValueMax</span>,  <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">500</span>
        <span style="color: #DFAF8F;">MemberChangeRecast</span>,
        <span style="color: #DFAF8F;">DamageRandMin</span>,
        <span style="color: #DFAF8F;">DamageRandMax</span>,
        <span style="color: #DFAF8F;">RecoverBonusMin</span>,
        <span style="color: #DFAF8F;">RecoverBonusMax</span>,
        <span style="color: #DFAF8F;">RecoverBonusInterval</span>,
        <span style="color: #DFAF8F;">RecoverBonusPlus</span>,
        <span style="color: #DFAF8F;">RecoverBonusSameElement</span>,
        <span style="color: #DFAF8F;">GuardCoef</span>,
        <span style="color: #DFAF8F;">ElementCoefRegist</span>,
        <span style="color: #DFAF8F;">ElementCoefWeak</span>,
        <span style="color: #DFAF8F;">ElementCoefRegistMin</span>,
        <span style="color: #DFAF8F;">ElementCoefRegistMax</span>,
        <span style="color: #DFAF8F;">ElementCoefDefaultMin</span>,
        <span style="color: #DFAF8F;">ElementCoefDefaultMax</span>,
        <span style="color: #DFAF8F;">ElementCoefWeakMin</span>,
        <span style="color: #DFAF8F;">ElementCoefWeakMax</span>,
        <span style="color: #DFAF8F;">CriticalProbablityMax</span>,
        <span style="color: #DFAF8F;">CriticalStrongElementCoef</span>,
        <span style="color: #DFAF8F;">CriticalCoef</span>,
        <span style="color: #DFAF8F;">CriticalAdjustmentCoef</span>,
        <span style="color: #DFAF8F;">TogetherCharge_OnAttack</span>,
        <span style="color: #DFAF8F;">TogetherCharge_OnAttack_weak</span>,
        <span style="color: #DFAF8F;">TogetherCharge_OnAttack_regist</span>,
        <span style="color: #DFAF8F;">TogetherCharge_OnAttackCriticalCoef</span>,
        <span style="color: #DFAF8F;">TogetherCharge_OnDamage</span>,
        <span style="color: #DFAF8F;">TogetherCharge_OnDamage_weak</span>,
        <span style="color: #DFAF8F;">TogetherCharge_OnDamage_regist</span>,
        <span style="color: #DFAF8F;">TogetherCharge_OnStun</span>,
        <span style="color: #DFAF8F;">TogetherAttackChainCoef_0</span>,
        <span style="color: #DFAF8F;">TogetherAttackChainCoef_1</span>,
        <span style="color: #DFAF8F;">TogetherAttackChainCoef_2</span>,
        <span style="color: #DFAF8F;">StateAbnormalConfusion_Turn</span>,
        <span style="color: #DFAF8F;">StateAbnormalParalysis_Turn</span>,
        <span style="color: #DFAF8F;">StateAbnormalParalysis_CancelProbability</span>,
        <span style="color: #DFAF8F;">StateAbnormalPoison_Turn</span>,
        <span style="color: #DFAF8F;">StateAbnormalPoison_DamageRatio</span>,
        <span style="color: #DFAF8F;">StateAbnormalBearish_Turn</span>,
        <span style="color: #DFAF8F;">StateAbnormalSleep_Turn</span>,
        <span style="color: #DFAF8F;">StateAbnormalSleep_LoadFactor</span>, <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">2.0</span>
        <span style="color: #DFAF8F;">StateAbnormalUnhappy_Turn</span>,
        <span style="color: #DFAF8F;">StateAbnormalSilence_Turn</span>,
        <span style="color: #DFAF8F;">StateAbnormalIsolation_Turn</span>,
        <span style="color: #DFAF8F;">HateValueMin</span>,
        <span style="color: #DFAF8F;">HateValueMax</span>,
        <span style="color: #DFAF8F;">HateAIConditionCoef</span>,
        <span style="color: #DFAF8F;">HateValueJoin1</span>,
        <span style="color: #DFAF8F;">DyingHpRatio</span>,
        <span style="color: #DFAF8F;">RegistedFriendTurn</span>,
        <span style="color: #DFAF8F;">UnregistedFriendTurn</span>,
        <span style="color: #DFAF8F;">StunValueMax</span>,
        <span style="color: #DFAF8F;">StunAdditiveOrderValueRatioWhenStun</span>,  <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">20</span>
        <span style="color: #DFAF8F;">StunAdditiveOrderValueRatioWhenAttacked</span>,  <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">50</span>
        <span style="color: #DFAF8F;">StunDecreaseValueOnTurnStart</span>,
        <span style="color: #DFAF8F;">BorderFromSkillLv_0</span>,
        <span style="color: #DFAF8F;">BorderFromSkillLv_1</span>,
        <span style="color: #DFAF8F;">BorderFromSkillLv_2</span>,
        <span style="color: #DFAF8F;">DamageDiv</span>,
        <span style="color: #DFAF8F;">Max</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 技能的种类.eSkillContentType</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-csharp"><span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">enum</span> <span style="color: #7CB8BB;">eSkillContentType</span>
{
        <span style="color: #DFAF8F;">Attack</span>,
        <span style="color: #DFAF8F;">Recover</span>,
        <span style="color: #DFAF8F;">StatusChange</span>,
        <span style="color: #DFAF8F;">StatusChangeReset</span>,
        <span style="color: #DFAF8F;">Abnormal</span>,
        <span style="color: #DFAF8F;">AbnormalRecover</span>,
        <span style="color: #DFAF8F;">AbnormalDisable</span>,
        <span style="color: #DFAF8F;">AbnormalAdditionalProbability</span>,
        <span style="color: #DFAF8F;">ElementResist</span>,
        <span style="color: #DFAF8F;">ElementChange</span>,
        <span style="color: #DFAF8F;">WeakElementBonus</span>,
        <span style="color: #DFAF8F;">NextAttackUp</span>,
        <span style="color: #DFAF8F;">NextAttackCritical</span>,
        <span style="color: #DFAF8F;">Barrier</span>,
        <span style="color: #DFAF8F;">RecastChange</span>,
        <span style="color: #DFAF8F;">KiraraJumpGaugeChange</span>,
        <span style="color: #DFAF8F;">KiraraJumpGaugeCoef</span>,
        <span style="color: #DFAF8F;">OrderChange</span>,
        <span style="color: #DFAF8F;">HateChange</span>,
        <span style="color: #DFAF8F;">ChargeChange</span>,
        <span style="color: #DFAF8F;">ChainCoefChange</span>,
        <span style="color: #DFAF8F;">Card</span>,
        <span style="color: #DFAF8F;">StunRecover</span>,
        <span style="color: #DFAF8F;">Regene</span>,
        <span style="color: #DFAF8F;">Num</span>
}
</pre>
</div>


<p>
<a href="code-map.html">go back to code map </a> <a href="#sec-1">go top</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: yuanchuan cao</p>
<p class="date">Created: 2018-06-08 五 15:55</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
